#pragma once
//================================================================================
// フェードアウト・イン
//--------------------------------------------------------------------------------
// fade.h
//--------------------------------------------------------------------------------
// 履歴
//================================================================================


//********************************************************************************
// インクルード部
//********************************************************************************
#include "main.h"


//状態
enum EFade
{
	FADE_NONE = 0,	//何もしない
	FADE_IN,		//フェードイン
	FADE_OUT,		//フェードアウト

	MAX_FADE
};

HRESULT InitFade();	//初期化
void UninitFade();	//終了処理
void UpdateFade();	//更新
void DrawFade();	//描画

void StartFadeOut();	//フェードアウト開始
EFade GetFade();		//状態取得
void SetfadeColor(float fR, float fG, float fB);	//フェードアウト色設定