//================================================================================
// ゲームシーン
//--------------------------------------------------------------------------------
// GameScene.cpp
//--------------------------------------------------------------------------------
// 2021 11/29 SatoKen コメント付け
//================================================================================


//********************************************************************************
// インクルード部
//********************************************************************************
#include "GameScene.h"
#include "meshfield.h"

#include "input.h"


//================================================================================
// コンストラクタ
//================================================================================
GameScene::GameScene()
	:m_pPlayer(nullptr),m_pBg(nullptr),m_pTestBill(nullptr)
{
	// オブジェクト生成
	m_pPlayer = new Player;
	m_pBg = new Bg;
	m_pTestBill = new TestBill;
}

//================================================================================
// デストラクタ
//================================================================================
GameScene::~GameScene()
{
	// オブジェクト解放
	if (m_pPlayer != nullptr)
	{
		delete m_pPlayer;
		m_pPlayer = nullptr;
	}

	if (m_pBg != nullptr)
	{
		delete m_pBg;
		m_pBg = nullptr;
	}

	if (m_pTestBill != nullptr)
	{
		delete m_pTestBill;
		m_pTestBill = nullptr;
	}
}

//================================================================================
// 初期化
//================================================================================
HRESULT GameScene::Init()
{
	HRESULT hr = S_OK;

	// 背景初期化
	hr = m_pBg->Init();

	// フィールド初期化
	hr = InitMeshField(8, 8, 80.0f, 80.0f);
	if (FAILED(hr))
		return hr;

	// プレイヤー初期化
	hr = m_pPlayer->Init();

	hr = m_pTestBill->Init();

	m_pTestBill->SetTestBill(XMFLOAT3(0.0f, 20.0f, 0.0f),
								XMFLOAT2(5.0f, 5.0f),
								XMFLOAT4(1.0f, 1.0f, 1.0f, 1.0f));

	return hr;
}


//================================================================================
// 終了
//================================================================================
void GameScene::Uninit()
{
	// 背景終了
	m_pBg->Uninit();
	
	// フィールド終了
	UninitMeshField();

	// プレイヤー終了
	m_pPlayer->Uninit();

	m_pTestBill->Uninit();
}


//================================================================================
// 更新
//================================================================================
void GameScene::Update()
{
	// 背景更新
	m_pBg->Update();
	
	// フィールド更新
	UpdateMeshField();

	// プレイヤー更新
	m_pPlayer->Update();

	m_pTestBill->Update();


	// タイトルに戻る
	if (GetKeyTrigger(VK_RETURN))
	{
		SelectScene(SCENE_TITLE);
	}
}

//================================================================================
// 描画
//================================================================================
void GameScene::Draw()
{
	// 背景描画
	m_pBg->Draw();
	
	// フィールド描画
	DrawMeshField();

	// プレイヤー描画
	m_pPlayer->Draw();

	m_pTestBill->Draw();
}
