//================================================================================
// テスト
//--------------------------------------------------------------------------------
// Test.cpp
//--------------------------------------------------------------------------------
// 2021 11/29 SatoKen コメント追加
//================================================================================


//********************************************************************************
// インクルード部
//********************************************************************************
#include "Test.h"


//********************************************************************************
// 定数・マクロ定義
//********************************************************************************
#define PATH_TEXTURE_TEST	(L"data/texture/tree000.png")		// テスト画像

#define POS_TEST			(XMFLOAT2(0.0f,0.0f))		// 位置（X,Y）
#define SIZE_TEST			(XMFLOAT2(100.0f,100.0f))	// サイズ（幅,高さ）
#define COLOR_TEST			(XMFLOAT3(1.0f,1.0f,1.0f))	// 色（R,G,B）
#define COUNT_TEST			(XMFLOAT2(1,1))				// コマ数（X,Y）
#define ANGLE_TEST			(0)							// 角度


//================================================================================
// コンストラクタ
//================================================================================
Test::Test()
{

}

//================================================================================
// デストラクタ
//================================================================================
Test::~Test()
{
}

//================================================================================
// 初期化
//================================================================================
HRESULT Test::Init()
{
	HRESULT hr = S_OK;
	ID3D11Device* pDevice = GetDevice();

	m_pos = POS_TEST;
	m_size = SIZE_TEST;
	m_color = COLOR_TEST;
	m_count = COUNT_TEST;
	m_angle = ANGLE_TEST;

	hr = CreateTextureFromFile(pDevice, PATH_TEXTURE_TEST, &m_pTexture);

	return hr;
}


//================================================================================
// 終了
//================================================================================
void Test::Uninit()
{
	// テクスチャ解放
	SAFE_RELEASE(m_pTexture);
}


//================================================================================
// 更新
//================================================================================
void Test::Update()
{

}

//================================================================================
// 描画
//================================================================================
void Test::Draw()
{
	// Zバッファ無効(Zチェック無&Z更新無)
	SetZBuffer(false);

	ID3D11DeviceContext* pDC = GetDeviceContext();

	SetPolygonPos(m_pos.x, m_pos.y);								// 表示位置
	SetPolygonSize(m_size.x, m_size.y);								// 表示サイズ
	SetPolygonColor(m_color.x, m_color.y, m_color.z);				// 色決定

	SetPolygonTexture(m_pTexture);									// 表示画像
	SetPolygonAngle(m_angle);										// 角度

	SetPolygonFrameSize(1 / m_count.x, 1 / m_count.y);				// 画像の中の枠１つ当たりのサイズ
	SetPolygonUV(0.0f, 0.0f);										// 表示画像の枠位置決定
	DrawPolygon(pDC);

	// 元に戻す
	SetPolygonUV(0.0f, 0.0f);
	SetPolygonFrameSize(1.0f, 1.0f);
	SetPolygonAngle(0);

	// Zバッファ有効(Zチェック有&Z更新有)
	SetZBuffer(true);

}